
#!/bin/bash
#Menu
clear
echo -e " "
echo -e " "╔╗╔╗╔═╗╔═╗╔═╗╔╗
echo -e " "║╚╝║║╦╝║╦╝║║║║║
echo -e " "║╔╗║║╩╗║╩╗║║║║║
echo -e " "╚╝╚╝╚═╝╚═╝╚═╝╠╣
echo -e " "─SCRIPT BY GUN-X─V.1.0
echo -e " "
echo -e " "•••[ 01 ]••• สร้างบัญชี SSH & VPN "
echo -e " "•••[ 02 ]••• สร้างบัญชีทดลอง"
echo -e " "•••[ 03 ]••• เปลี่ยนชื่อและรหัสผ่านผู้ใช้"
echo -e " "•••[ 04 ]••• เปลี่ยนวันหมดอายุ"
echo -e " "•••[ 05 ]••• เปลี่ยนวันหมดอายุ"
echo -e " "•••[ 06 ]••• ลบบัญชีหมดอายุอัตโนมัติ"
echo -e " "•••[ 07 ]••• ดูผู้ใช้ที่ใช้งานอยู่ทั้งหมด"
echo -e " "•••[ 08 ]••• รีสตาร์ต dropbear,squid3 "
echo -e " "•••[ 09 ]••• เทสความเร็ว VPS "
echo -e " "•••[ 10 ]••• เช็คดูแบนวิทที่ใช้งาน "
echo -e " "•••[ 11 ]••• เพิ่มพ็อต OPENVPN"
echo -e " "•••[ 12 ]••• แบนผู้ใช้ "
echo -e " "•••[ 13 ]••• ปลดแบนผู้ใช้"
echo -e " "•••[ 14 ]••• ใส่เครดิตแอป HTTP "
echo -e " "•••[ 15 ]••• รายละเอียดสคริป "
echo -e " "•••[ 16 ]••• ตั้งเวลารีบูตอัตโนมัติ"
echo -e " "•••[ 17 ]••• สำรองและคืนค่าชื่อผู้ใช้ "
echo -e " "•••[ 18 ]••• ตั้งค่ากำหนดความเร็ว"
echo -e " "•••[ 19 ]••• สร้างไฟล์และเคลียไฟล์ "
echo -e " "•••[ 20 ]••• เปลี่ยนสิทธิ ROOT"
echo -e " "•••[ 21 ]••• ลบบัญชีผู้ใช้ทั้งหมด  "
echo -e " "•••[ 22 ]••• เช็ควันหมดอายุบัญชี"
echo -e " "•••[ 23 ]••• เช็คผู้ใช้งาน SSH"
echo -e " "•••[ 24 ]••• ติดตั้งระบบ PPTP"
echo -e " "•••[ 25 ]••• เข้ารหัสลับสคริป "
echo -e " "•••[ 26 ]••• แก้ไข HosT"
echo -e " "•••[ 27 ]••• สร้างไฟล์ที่แก้ไขHosT "
echo -e " "•••[ 28 ]••• แก้ไขport proxy"
echo -e " "•••[ 29 ]••• อัพเดทเมนูสคิป"
echo -e " "•••[ 30 ]••• เปิด-ปิด ใส่รหัสproxy"
echo -e " "•••[   __]••• รีบูตเครื่อง VPS ให้พิมพ์reboot  "
echo -e " "•••[ 31 ]••• จำกัดจำนวนผู้ใช้ไฟล์พอต1194"
echo -e " "•••[ 32 ]••• จำกัดจำนวนผู้ใช้ไฟล์พอต443"
echo -e " "•••[ 00 ]••• ออกจากเครื่อง "
      
echo -e ""
